CSI API ETABS v1
cPointElm.GetConnectivity Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetConnectivity(
	string Name,
	ref int NumberItems,
	ref int[] ObjectType,
	ref string[] ObjectName,
	ref int[] PointNumber
)
Function GetConnectivity (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef ObjectType As Integer(),
	ByRef ObjectName As String(),
	ByRef PointNumber As Integer()
) As Integer
Dim instance As cPointElm
Dim Name As String
Dim NumberItems As Integer
Dim ObjectType As Integer()
Dim ObjectName As String()
Dim PointNumber As Integer()
Dim returnValue As Integer
returnValue = instance.GetConnectivity(Name,
	NumberItems, ObjectType, ObjectName,
	PointNumber)
int GetConnectivity(
	String^ Name,
	int% NumberItems,
	array<int>^% ObjectType,
	array<String^>^% ObjectName,
	array<int>^% PointNumber
)
abstract GetConnectivity :
        Name : string *
        NumberItems : int byref *
        ObjectType : int[] byref *
        ObjectName : string[] byref *
        PointNumber : int[] byref -> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
ObjectType
Type: System.Int32[]
ObjectName
Type: System.String[]
PointNumber
Type: System.Int32[]
Return Value
Type: Int32
See Also
Reference
cPointElm Interface
ETABSv1 Namespace